# GetHostPointReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointRelativeToPoint..::..GetHostPointReference Method
PointRelativeToPoint Class See Also
---
Get a copy of the host point reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Reference GetHostPointReference()
```

Visual Basic
---
```text
Public Function GetHostPointReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetHostPointReference()
```

# See Also
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace